# 13 TypeScript 类的 Getter、Setter 和 static 使用

之前学了类的访问类型`private`，那这个东西如何使用？其实他的最大用处是封装一个属性，然后通过`Getter`和`Setter`的形式来访问和修改这个属性。

## 13.1 类的 Getter 和 Setter

## 13.1.1 Getter

声明一个XiaoJieJie（小姐姐）类，小姐姐的年龄是不能随便告诉人，使用private,这样别人就都不知道她的真实年龄，而只有她自己知道。

如果别人想知道，就必须通过`getter`属性知道,注意我这里用的是属性，对他就是一个属性。`getter`属性的关键字是`get`,后边跟着类似方法的东西,但是你要注意，它并不是方法，归根到底还是属性。

玄妙就在于getter里，我们可以对_age进行处理，比如别人问的时候我们就偷摸的减少 10 岁。

## 13.1.2 Setter

`\_age`是私有的，那类的外部就没办法改变，所以这时候可以用`setter`属性进行改变

## 13.2 类中的 static

我们先写一下最常规的写法：

但是现在你不想`new`出对象，而直接使用这个方法，那`TypeScript`为你提供了快捷的方式，用`static`声明的属性和方法，不需要进行声明对象，就可以直接使用

> 需要注意的是，用`static`声明的属性和方法，才不需要进行声明对象